app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]
---

  <h4><%=pluralize(@article.comments.count, 'comment') %> </h4>