app/controllers/articles_controller.rb

  def show
    if current_user
      @user = User.find(current_user.id)
      #@article = @user.articles.find(params[:id])
      @article = Article.find(params[:id])
      @vote = @article.votes.find_by_voter(current_user.id)
      @voted = false
      @article.votes.each do |vote|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT 1  [["user_id", 4], ["id", 7]]

  def new
    if current_user
      @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]

  def edit
    if current_user
      @user = User.find(current_user.id)
      @article = @user.articles.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT 1  [["user_id", 4], ["id", 1]]

  def create
    @user = User.find(current_user.id)
    @article = @user.articles.new(article_params)
    @article.user_id = current_user.id
    if @article.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "articles" ("title", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Resources"], ["text", "These are good resources."], ["user_id", 4], ["created_at", "2015-09-04 12:13:04.842851"], ["updated_at", "2015-09-04 12:13:04.842851"]]

  def update
    if current_user
      @user = User.find(current_user.id)
      @article = @user.articles.find(params[:id])
      if @article.update(article_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT 1  [["user_id", 4], ["id", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Resourcess"], ["updated_at", "2015-09-04 13:08:55.130099"], ["id", 1]]

  def destroy
    if current_user
      @user = User.find(current_user.id)
      @article = @user.articles.find(params[:id])
      @article.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT 1  [["user_id", 4], ["id", 3]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]