app/controllers/users_controller.rb

  def index
    if current_user
      @user = User.all
      @articles = Article.all
---
SELECT "users".* FROM "users"
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password_salt", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)